test/performance/profiles/http-tests.yaml
# =============================================================================
# CONSOLIDATED HTTP API TESTS
# =============================================================================
# This file contains all HTTP-based performance test profiles using Artillery's
# environments feature. Each environment (smoke/load) has its own phases
# and SLAs, but shares the same scenario definitions.
#
# Usage:
#   artillery run -e smoke /scripts/profiles/http-tests.yaml
#   artillery run -e load /scripts/profiles/http-tests.yaml
#
# Or via Makefile:
#   make test-perf-smoke
#   make test-perf-load
#
# IMPORTANT: All 8 scenarios run in ALL environments (smoke/load).
# Environments differ ONLY in their phases (duration/traffic) and SLAs.
# Scenario weights, think times, and request flows are identical across
# all environments. This is a fundamental limitation of Artillery's
# environments feature - scenarios cannot be selectively enabled per environment.
# =============================================================================

config:
  target: "{{ $processEnvironment.ARTILLERY_TARGET }}"

  plugins:
    expect: {}
    metrics-by-endpoint: {}

  processor: "/scripts/processors/functions.js"

  defaults:
    headers:
      Content-Type: "application/json"

  # ==========================================================================
  # ENVIRONMENT: SMOKE TEST
  # ==========================================================================
  # Purpose: Fast sanity check that all endpoints are reachable and functional
  # Duration: ~30 seconds
  # Use when: CI pipelines, pre-deployment checks, quick health validation
  #
  # What it tests:
  #   - All 7 API scenarios run with light traffic (2-5 req/s)
  #   - Validates that endpoints are reachable and respond correctly
  #   - Quick health check suitable for CI/CD pipelines
  #   - Expected behavior: All requests succeed, fast response times
  #
  # SLAs:
  #   - p99 response time < 2 seconds
  #   - Error rate < 1%
  #
  # Differences from load profile:
  #   - Shortest duration (30s vs ~12 min for load)
  #   - Lowest traffic (2-5 req/s vs up to 12 req/s for load)
  #   - Strictest SLAs (designed to pass reliably)
  # ==========================================================================
  environments:
    smoke:
      phases:
        - name: "Smoke test"
          duration: 30
          arrivalRate: 2
          rampTo: 5

      ensure:
        # p99 < 2s: 99th percentile response time must be under 2 seconds
        # Chosen as a generous upper bound for a healthy system under light load
        p99: 2000
        # maxErrorRate < 1%: Less than 1% of requests can fail
        # Smoke tests should have near-zero errors; any failures indicate a problem
        maxErrorRate: 1

    # ========================================================================
    # ENVIRONMENT: LOAD TEST
    # ========================================================================
    # Purpose: Measure system performance under expected production-like traffic
    # Duration: ~12 minutes
    # Use when: Establishing performance baselines, capacity planning, regression testing
    #
    # What it tests:
    #   - All 8 API scenarios run with production-like traffic (2-12 req/s)
    #   - Sustained load over 12 minutes to establish performance baselines
    #   - Tests system stability under realistic user patterns
    #   - Expected behavior: Maintains low latency (p99 < 2s, median < 750ms)
    #
    # Traffic pattern:
    #   - Warm up:      60s at 2 req/s
    #   - Ramp up:      120s from 2 to 8 req/s
    #   - Sustained:    300s at 8 req/s
    #   - Peak:         180s at 12 req/s
    #   - Cool down:    60s from 12 to 2 req/s
    #
    # SLAs:
    #   - p99 response time < 2 seconds
    #   - Median response time < 750ms
    #   - Error rate < 1%
    #
    # Differences from other profiles:
    #   - Medium duration (12 min vs 30s for smoke, 15 min for stress)
    #   - Production-like traffic (2-12 req/s steady)
    #   - Includes median latency SLA (< 750ms) for user experience validation
    #   - Multi-phase pattern: warm up → ramp → sustained → peak → cool down
    # ========================================================================
    load:
      phases:
        - name: "Warm up"
          duration: 60
          arrivalRate: 2
        - name: "Ramp up"
          duration: 240
          arrivalRate: 2
          rampTo: 8
        - name: "Sustained load"
          duration: 300
          arrivalRate: 8
        - name: "Peak load"
          duration: 180
          arrivalRate: 12
        - name: "Cool down"
          duration: 60
          arrivalRate: 12
          rampTo: 2

      ensure:
        # p99 < 2s: 99th percentile must stay under 2 seconds even at peak load
        # This ensures outliers don't degrade user experience significantly
        p99: 2000
        # median < 750ms: t2.small's 20% CPU baseline (~0.2 vCPU) raises latency
        # floor vs the t3.large this suite was originally written for (0.6 vCPU).
        # 750ms is still comfortably user-perceptible as responsive and will flag
        # genuine regressions without producing false failures on the slower instance.
        median: 750
        # maxErrorRate < 1%: Production-like load should not cause errors
        # Errors under sustained load indicate capacity or stability issues
        maxErrorRate: 1


# =============================================================================
# SHARED SCENARIOS
# =============================================================================
# All scenarios below are shared across smoke/load environments.
# Artillery's environments feature means ALL scenarios run in ALL environments,
# with different phases and SLAs per environment controlling the test behavior.
#
# Scenario design:
# - All scenarios include expect blocks for response validation
# - Think times simulate human pacing between actions (1–3s for HTTP, 1s + replDelay for REPL)
# - No continueOnError flags - tests fail fast for clearer debugging
# - Traffic differentiation comes from environment-specific phases and SLAs
# =============================================================================

scenarios:
  # ===========================================================================
  # BASIC API SCENARIOS
  # ===========================================================================

  - name: "List features"
    weight: 1
    flow:
      - get:
          url: "/v1/features"
          expect:
            - statusCode: 200

  # ===========================================================================
  # AUTHENTICATION SCENARIOS
  # ===========================================================================

  - name: "Auth flow"
    weight: 2
    flow:
      - function: "generatePrivateKey"
      - post:
          url: "/v1/auth/register"
          json:
            private_key: "{{ privateKey }}"
          capture:
            - json: "$.id"
              as: "accountId"
          expect:
            - statusCode: 200
            - hasProperty: "id"
      - think: 2
      - post:
          url: "/v1/auth/login"
          json:
            private_key: "{{ privateKey }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
            - hasProperty: "token"
      - think: 2
      - get:
          url: "/v1/auth/session"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      - get:
          url: "/v1/progress"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - hasProperty: "account"
            - hasProperty: "progress"
            - hasProperty: "progress_state"
      - post:
          url: "/v1/auth/logout"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # ===========================================================================
  # USER SESSION SCENARIOS
  # ===========================================================================

  - name: "Anonymous browsing"
    weight: 3
    flow:
      - get:
          url: "/v1/features"
          expect:
            - statusCode: 200
      - think: 3
      - get:
          url: "/v1/features"
          expect:
            - statusCode: 200

  - name: "Authenticated user session"
    weight: 3
    flow:
      - function: "generatePrivateKey"
      - post:
          url: "/v1/auth/register"
          json:
            private_key: "{{ privateKey }}"
          capture:
            - json: "$.id"
              as: "accountId"
          expect:
            - statusCode: 200
      - post:
          url: "/v1/auth/login"
          json:
            private_key: "{{ privateKey }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      - think: 2
      - function: "generateProgressState"
      - get:
          url: "/v1/progress"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      - think: 3
      - put:
          url: "/v1/progress"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            progress_state: "{{ progressState }}"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/v1/accounts/{{ accountId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      - post:
          url: "/v1/auth/logout"
          headers:
            Authorization: "Bearer {{ authToken }}"

  # ===========================================================================
  # DATA OPERATION SCENARIOS
  # ===========================================================================

  - name: "Lesson data flow"
    weight: 2
    flow:
      - function: "generatePrivateKey"
      - post:
          url: "/v1/auth/register"
          json:
            private_key: "{{ privateKey }}"
          capture:
            - json: "$.id"
              as: "accountId"
      - post:
          url: "/v1/auth/login"
          json:
            private_key: "{{ privateKey }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 3
      - put:
          url: "/v1/data"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            lesson_id: "CH1INT1"
            data:
              code: "console.log('hello')"
              timestamp: "{{ $timestamp }}"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/v1/data/CH1INT1"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  - name: "Feature updates"
    weight: 1
    flow:
      - function: "generateTestId"
      - put:
          url: "/v1/features"
          json:
            feature_name: "{{ testId }}"
            feature_value: 1
          expect:
            - statusCode: 200

  # ===========================================================================
  # WEBSOCKET REPL SCENARIOS
  # ===========================================================================
  # Note: WebSocket scenarios require separate engine declaration.
  # ===========================================================================

  - name: "REPL JavaScript execution"
    weight: 1
    engine: ws
    flow:
      - function: "generateJsReplCode"
      - connect: "{{ $processEnvironment.ARTILLERY_WS_TARGET }}"
      - think: 1
      # Dynamic JS code with variable execution time (1-40s, see processors/functions.js)
      - send:
          action: "repl"
          payload:
            code: "{{ replCode }}"
            language: "javascript"
      - think: "{{ replDelay }}"